In [2]:
import pandas as pd

In [3]:
titles = pd.read_csv('titles.csv')
cast = pd.read_csv('cast.csv')
titles.shape[0]
titles.head(5)

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

244914

### How many movies are listed in the titles dataframe?

In [5]:

titles.shape[0]

244914

### What are the earliest two films listed in the titles dataframe?

In [6]:
earliest=titles.sort_values(by = 'year')
earliest.head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [10]:
titles[titles['title']=='Hamlet'].count()

title    20
year     20
dtype: int64

### How many movies are titled "North by Northwest"?

In [11]:

titles[titles['title'] == "North by Northwest"].count()

title    1
year     1
dtype: int64

### When was the first movie titled "Hamlet" made?

In [21]:

titles[titles['title'] == "Hamlet"].sort_values(by='year').head(1)
# titles.head(0)

        title  year
52521  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [23]:
titles1=titles.sort_values(by = 'year')
titles1[titles1['title'] == "Treasure Island"]

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

### How many movies were made in the year 1950?

In [28]:
titles[titles['year'] == 1950].count()

title    1113
year     1113
dtype: int64

### How many movies were made in the year 1960?

In [31]:
titles[titles['year'] == 1960].count()

title    1549
year     1549
dtype: int64

### How many movies were made from 1950 through 1959?

In [36]:
titles[(titles['year'] >= 1950) & (titles['year'] <= 1959)].count()

title    12934
year     12934
dtype: int64

### In what years has a movie titled "Batman" been released?

In [39]:
titles1=titles.sort_values(by = 'year')
titles1=titles1[titles1['title'] == "Batman"]
titles1.head()

         title  year
39349   Batman  1943
240896  Batman  1989

### How many roles were there in the movie "Inception"?

In [47]:
cast[cast['title'] == 'Inception']['character'].count()

0

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [48]:
cast[cast['title'] == 'Inception']['n'].isnull().sum()

0

### But how many roles in the movie "Inception" did receive an "n" value?

In [49]:
cast[cast['title'] == 'Inception']['n'].notnull().sum()

0

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [50]:
cast[cast['title'] == 'North by Northwest']['n'].notnull().sum()

0

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [55]:
cast2 = cast[cast.n.notnull()].sort_values(by=['n'])
print('The entire cast, in "n"-order, of the 1972 film "Sleuth":')
cast2 = cast2.loc[(cast2['title']=='Sleuth') & (cast2['year']==1972)][['name','n']].reset_index(drop=True)
cast2

The entire cast, in "n"-order, of the 1972 film "Sleuth":

Empty DataFrame
Columns: [name, n]
Index: []

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [56]:
cast3 = cast[cast.n.notnull()].sort_values(by=['n'])
print('The entire cast, in "n"-order, of the 2007 film "Sleuth":')
cast3 = cast3.loc[(cast3['title']=='Sleuth') & (cast3['year']==2007)][['name','n']].reset_index(drop=True)
cast3

The entire cast, in "n"-order, of the 2007 film "Sleuth":

Empty DataFrame
Columns: [name, n]
Index: []

### How many roles were credited in the silent 1921 version of Hamlet?

In [57]:
cast4 = cast.loc[(cast['title']=='Hamlet') & (cast['year']==1921)]
cast4['character'].count()

1

### How many roles were credited in Branagh’s 1996 Hamlet?

In [59]:
cast5 = cast.loc[(cast['title']=='Hamlet') & (cast['year']==1996)]
cast5['character'].count()

1

### How many "Hamlet" roles have been listed in all film credits through history?

In [60]:
cast6 = cast[cast['title'] == 'Hamlet']
cast6['character'].count()

9

### How many people have played an "Ophelia"?

In [61]:
cast[cast['character'] == 'Ophelia']['name'].count()

1

### How many people have played a role called "The Dude"?

In [62]:
cast[cast['character'] == 'The Dude']['name'].count()

0

### How many people have played a role called "The Stranger"?

In [63]:
cast[cast['character'] == 'The Stranger']['name'].count()

2

### How many roles has Sidney Poitier played throughout his career?

In [64]:
cast[cast['name'] == "Sidney Poitier"]['character'].count()

0

### How many roles has Judi Dench played?

In [65]:
cast[cast['name'] == "Judi Dench"]['character'].count()

0

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [66]:
cast6 = cast[(cast['name'] == "Cary Grant") & (cast['n'] == 2) & (cast['year'] >= 1940) & (cast['year'] < 1950)]
li = cast6[['character','year']].values.tolist()
print("Following are the supporting roles played by Cary Grant in the 1940s:\n")
cg = pd.DataFrame(li, columns = ['Supporting Role', 'Year'])
cg

Following are the supporting roles played by Cary Grant in the 1940s:

Empty DataFrame
Columns: [Supporting Role, Year]
Index: []

### List the leading roles that Cary Grant played in the 1940s in order by year.

In [67]:
cast7 = cast[(cast['name'] == "Cary Grant") & (cast['n'] == 1) & (cast['year'] >= 1940) & (cast['year'] < 1950)].sort_values(by = ['year'])
lis= cast7[['character','year']].values.tolist()
print("Following are the leading roles played by Cary Grant in the 1940s:\n")
cg_lead = pd.DataFrame(lis, columns = ['Leading Role', 'Year'])
cg_lead

Following are the leading roles played by Cary Grant in the 1940s:

Empty DataFrame
Columns: [Leading Role, Year]
Index: []

### How many roles were available for actors in the 1950s?

In [68]:
cast[(cast['year'] >= 1950) & (cast['year'] < 1960) & (cast['type'] == 'actor')]['character'].count()

2877

### How many roles were available for actresses in the 1950s?

In [69]:
cast[(cast['year'] >= 1950) & (cast['year'] < 1960) & (cast['type'] == 'actress')]['character'].count()

1015

### How many leading roles (n=1) were available from the beginning of film history through 1980?

In [70]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] == 1)]['character'].count()

1310

### How many non-leading roles were available through from the beginning of film history through 1980?

In [71]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980) & (cast['n'] > 1)]['character'].count()

12204

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [72]:
cast[(cast['year'] >= 1894) & (cast['year'] <= 1980)]['n'].isnull().sum()

8126